{"data":{"markdownRemark":{"html":"<h2>Step by Step Guide</h2>\n<p>This guide builds a static blog on Github Pages with Gatsby on MacOS. The official documentation on getting started with Github Pages is for pages written with Jekyll. You may skip some of the steps depending on your needs.</p>\n<h2>Why Gatsby</h2>\n<p>Github Pages officially recommends using Jekyll. Jekyll is a ruby-based static site generator. Its founder also happens to be the co-founder of Github and perhaps that's why Github officially recommends using Jekyll. It is true that there are various pre-made Jekyll themes, and communities for setting up blogs using Jekyll are quite popular. However, I prefer using react.js, which is why I chose Gatsby. </p>\n<h4>0. Create Github account</h4>\n<p>To host a blog on <a href=\"https://pages.github.com\">Github Pages</a>, you first need to set up your account on <a href=\"github.com\">Github</a>. </p>\n<h4>1. Create your blog repository on your Github</h4>\n<p>Go to your github profile, and create a new repository for your blog. You have to name your repository the same as your Github account name. </p>\n<h4>2. Install nodejs</h4>\n<h4>2-1. install homebrew on your Macos</h4>\n<p>Once you have created a new repo, make sure you have homebrew installed in your MacOS. If you don't have one already, simply install one.<br>\nOn your Terminal application, type in the following command and hit enter:<br>\n<code class=\"language-text\">/usr/bin/ruby -e &quot;$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)</code></p>\n<p>Confirm that homebrew is installed fine with the command <code class=\"language-text\">brew help</code>.</p>\n<h5>2-2. install Node.js &#x26; NPM</h5>\n<p>Now install Node.js and NPM:\n'brew install node'</p>\n<p>Confirm both are installed:\nnode -v\nnpm -v\nEach should show the version that is installed in your MacOS.</p>\n<h4>3. Choose Gatsby starter</h4>\n<p>Gatsby offers pre-made <a href=\"https://www.gatsbyjs.org/starters/?v=2\">starters</a>. You can choose any one of these starters in Gatsby starter library. Each starter theme has a linked Github source as shown below. You can find the below starter <a href=\"https://www.gatsbyjs.org/starters/niklasmtj/gatsby-starter-julia/\">here</a>.\n<img src=\"../%E2%81%A8images%E2%81%A9/juliaDoeEx.png\" alt=\"aaa\">\nClick on it and check out the Readme markdown. That is where the detailed explanation on how to set up app for React using Gatsby CLI.</p>\n<h3>4. Testing out on your local server (before pushing to Github Pages)</h3>\n<p>Once you have set up your blog app, you are now set to demo it. Before officially pushing your newly created blog to Github Pages by \"pushing\" it to the remote repo, you can test it out on your local server. This is a smart way to confirm to yourself that everything is working as it is supposed to, before making it go live, available for everyone else to see.</p>\n<p>Simply use the command <code class=\"language-text\">gatsby develop</code>. This runs your blog on your local server port number 8000.\nNow go on to your internet browser, and type in 'localhost:8000' and see what your blog actually looks like. </p>\n<p>If you want to stop running it on your local server, simply quit by <code class=\"language-text\">ctrl c</code> on your terminal.</p>\n<h3>5. Push Github app to Github Pages</h3>\n<p>The easiest way to push a Gatsby app to GitHub Pages is by using a package called gh-pages.\nThe rest of the steps are well documented on the official <a href=\"https://www.gatsbyjs.org/docs/how-gatsby-works-with-github-pages/\">Gatsby page</a>.</p>","excerpt":"Step by Step GuideThis guide builds a static blog on Github Pages with Gatsby on MacOS. The official documentation on getting started with Github Pages is for…","frontmatter":{"date":"25 June, 2019","path":"/blog/myexample","title":"Static Blogging with Gatsby on Github Pages"},"fields":{"readingTime":{"text":"3 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}